app/views/forums/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
        <tr>
          <td><%= User.find_by_id(a[:user_id]).login %></td>