app/controllers/forums_controller.rb

SELECT "forums".* FROM "forums"
---
  def index
    @forums = Forum.all

INSERT INTO "messages" ("text", "created_at", "updated_at", "user_id", "forum_id") VALUES (?, ?, ?, ?, ?)  [["text", "Hello world!"], ["created_at", "2018-12-16 19:52:00.936245"], ["updated_at", "2018-12-16 19:52:00.936245"], ["user_id", 3], ["forum_id", 1]]
---
  def show
    if params[:mes]
      if params[:mes].length > 0
      ans = Message.create(:text => params[:mes], :forum_id => @forum.id, :user_id => current_user.id)

INSERT INTO "forums" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Главный"], ["created_at", "2018-12-16 16:11:17.387875"], ["updated_at", "2018-12-16 16:11:17.387875"]]
---
  def create
    if forum_params[:name].length != 0
      @forum = Forum.new(forum_params)
    else
      @problem = 1
      respond_to do |format|
        format.html { render :new }
        format.json { render json: @problem, status: :unprocessable_entity }
      end
    end
    if @forum
      respond_to do |format|
        if @forum.save

DELETE FROM "forums" WHERE "forums"."id" = ?  [["id", 3]]
---
  def destroy
    @forum.destroy

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_forum
      @forum = Forum.find(params[:id])