app/controllers/main_controller.rb

SELECT COUNT(*) FROM "forums"
SELECT COUNT(*) FROM "messages"
SELECT COUNT(*) FROM "users"
---
  def view
    @answer = [t(:'We`ve done:'), '', t(:'Messages wrote -'), Message.count, t(:'Users created -'), User.count, t(:'Forums created -'), Forum.count]