app/controllers/sess_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."login" = ? LIMIT ?  [["login", "admin"], ["LIMIT", 1]]
---
  def middle
    if (!User.find_by_login(params[:login]).nil?) and (user = User.authenticate(params[:login], params[:password]))