app/controllers/users_controller.rb

INSERT INTO "users" ("login", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["login", "admin"], ["password", "admin"], ["created_at", "2018-12-16 14:17:02.265301"], ["updated_at", "2018-12-16 14:17:02.265301"]]
---
  def create
    if user_params[:login].length != 0 and user_params[:password].length != 0
      @user = User.new(user_params)
    else
      @problem = 1
      respond_to do |format|
        format.html { render :new }
        format.json { render json: @problem, status: :unprocessable_entity }
      end
    end
    if @user
      respond_to do |format|
        if @user.save

UPDATE "users" SET "password" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["password", "aaabbb"], ["updated_at", "2018-12-21 06:00:28.898132"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)